Tekla Open API Reference for Tekla Structures 2025
ReinforcementGroupAttributes Constructor
Overload List
Name | Description
ReinforcementBase.ReinforcementGroupAttributes()
 Creates a new default reinforcement attributes instance that loads standard attributes.
ReinforcementBase.ReinforcementGroupAttributes(String)
 Creates a new reinforcement attributes instance that loads the specified attributes.
Top
See Also
Reference
ReinforcementBase.ReinforcementGroupAttributes Class
Tekla.Structures.Drawing Namespace